const htmlEntitiesMap: Array<[string, string]> = [
  ['nbsp', '\xA0'], // неразрывный пробел
  ['ensp', '\u2002'], // en пробел
  ['emsp', '\u2003'], // em пробел
  ['thinsp', '\u2009'], // тонкий пробел
  ['zwnj', '\u200C'], // нулевой ширины не-соединитель
  ['zwj', '\u200D'], // нулевой ширины соединитель
  ['quot', '"'], // двойная кавычка
  ['amp', ''], // амперсанд
  ['lt', '<'], // меньше
  ['gt', '>'], // больше
  ['apos', "'"], // апостроф

  ['mdash', '—'], // длинное тире
  ['ndash', '–'], // среднее тире
  ['minus', '−'], // минус

  ['laquo', '«'], // левая кавычка-ёлочка
  ['raquo', '»'], // правая кавычка-ёлочка
  ['ldquo', '"'], // левая двойная кавычка
  ['rdquo', '"'], // правая двойная кавычка
  ['lsquo', "'"], // левая одинарная кавычка
  ['rsquo', "'"], // правая одинарная кавычка
  ['sbquo', '‚'], // нижняя одинарная кавычка
  ['bdquo', '„'], // нижняя двойная кавычка

  ['copy', '©'], // копирайт
  ['reg', '®'], // зарегистрированная торговая марка
  ['trade', '™'], // торговая марка
  ['deg', '°'], // градус
  ['hellip', '…'], // многоточие
  ['bull', '•'], // буллет
  ['middot', '·'], // средняя точка

  ['times', '×'], // умножить
  ['divide', '÷'], // разделить
  ['plusmn', '±'], // плюс-минус
  ['ne', '≠'], // не равно
  ['le', '≤'], // меньше или равно
  ['ge', '≥'], // больше или равно
  ['asymp', '≈'], // приблизительно равно

  ['euro', '€'], // евро
  ['pound', '£'], // фунт
  ['yen', '¥'], // йена
  ['cent', '¢'], // цент
  ['rub', '₽'], // рубль
  ['dollar', '$'], // доллар

  ['larr', '←'], // стрелка влево
  ['rarr', '→'], // стрелка вправо
  ['uarr', '↑'], // стрелка вверх
  ['darr', '↓'], // стрелка вниз
  ['harr', '↔'], // стрелка влево-вправо

  ['frac14', '¼'], // одна четверть
  ['frac12', '½'], // одна второя
  ['frac34', '¾'] // три четверти
];

export function decodeHtmlEntities(text: string): string {
  return htmlEntitiesMap
    .reduce(
      (currentText: string, [htmlEntity, decodedEntity]: [string, string]): string =>
        currentText.replaceAll(`&${htmlEntity};`, decodedEntity),
      text
    )
    .replaceAll(/&#(\d+);/g, (_, dec) => String.fromCharCode(dec))
    .replaceAll(/&#x([0-9A-Fa-f]+);/g, (_, hex) => String.fromCharCode(parseInt(hex, 16)));
}
